In [112]:
import pandas as pd
import numpy as np

In [111]:
pessoas_Df = pd.read_csv("dataset\DATASET.CSV",delimiter=';')

In [124]:
df_tmp = pessoas_Df
df_tmp

            Primeiro Nome           Sobrenomes Peso (kg) Altura (m)
0                  felipe        neves da hora      70,6       1,69
1                sandro                barbosa      90,5       1,73
2                  maycon    da silva ferreira    100,01       1,82
3             jeferson                Oliveira     80,04       1,75
4                  manuel       gomes   vieira     63,05        1,8
..                    ...                  ...       ...        ...
94                   Luna           Lunara Lua        70       1,86
95                  hulk                  jose      35,5        1,2
96                  maria                gomes     58,05       1,56
97                  paulo                rocha     98,07          2
98  Luane                   Santana   Teixeira     50,78        1,5

[99 rows x 4 columns]

In [125]:
df_tmp['Peso (kg)'] = df_tmp['Peso (kg)'].str.replace(',', '.').astype(float)
df_tmp['Altura (m)'] = df_tmp['Altura (m)'].str.replace(',', '.').astype(float)

In [126]:
df_tmp.head()

  Primeiro Nome         Sobrenomes  Peso (kg)  Altura (m)
0        felipe      neves da hora      70.60        1.69
1      sandro              barbosa      90.50        1.73
2        maycon  da silva ferreira     100.01        1.82
3   jeferson              Oliveira      80.04        1.75
4        manuel     gomes   vieira      63.05        1.80

In [138]:
def calcular_imc(df):
    df['IMC'] = df['Peso (kg)'] / (df['Altura (m)'] ** 2)
    df['IMC'] = df['IMC'].round(2)
    return df
def mostrar_dados(df):
    # Selecionar e retornar as colunas desejadas
    return df[['Primeiro Nome', 'Sobrenomes', 'IMC']]

In [131]:
df_tmp = calcular_imc(df_tmp)

In [141]:
df_resultado = mostrar_dados(df_tmp)

In [147]:
df_resultado.to_csv('resultado_imc.csv', sep='\t', index=False)